---
type: TriangleInShellComponent
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# TriangleInShellComponent

`Autodesk.Revit.DB.TriangleInShellComponent` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TriangleInShellComponent | 2013 | `public TriangleInShellComponent ( TriangleInShellComponent other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | VertexIndex0 | 2013 | `public int VertexIndex0 { get ; }` |
| Property | VertexIndex1 | 2013 | `public int VertexIndex1 { get ; }` |
| Property | VertexIndex2 | 2013 | `public int VertexIndex2 { get ; }` |